Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Comment>Дата приема на работу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Comment>Дата увольнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагУволен</Name>
					<Comment>Флаг уволен</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения сотрудника</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Признак сотрудника как исполнителя работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Comment>Основной цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Comment>Имя используемое для представления в "Записи на ремонт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Карточка</Name>
					<Comment>Карточка сотрудника для входа в АРМ "Сотрудник цеха"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРесурса</Name>
					<Comment>Тип ресурса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>Цвет в списке планируемых ресурсов</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФаксимилеПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВПланировании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИспользованияРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТипыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТипыРесурсов</Name>
			<Comment>Типы ресурсов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДоступныеТипыАвторабот</Name>
					<Comment>Доступные типы авторабот</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипАвтоработы</Name>
							<Comment>Тип автоработы</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыАвторабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеТипыАвтомобилей</Name>
					<Comment>Доступные типы автомобилей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипАвтомобиля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыАвтомобилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПланированиеРесурсовВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Получить порядок элементов
//
// Параметры:
//  МассивЭлементов	 - Массив	 - Массив объектов
// 
// Возвращаемое значение:
//  Массив - Массив отсортированных элементов.
//
Функция ПолучитьПорядокЭлементов(МассивЭлементов) Экспорт
	
	Если МассивЭлементов.Количество() = 0 Тогда
		Возврат МассивЭлементов;
	КонецЕсли;
	
	// порядок авторабот
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОбъектов.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаОбъектов.ОбъектПланирования КАК ОбъектПланирования,
		|	ТаблицаОбъектов.ТипЭлемента КАК ТипЭлемента,
		|	ТаблицаОбъектов.ИдентификаторПричиныОбращения КАК ИдентификаторПричиныОбращения
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаОбъектов КАК ТаблицаОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ЕстьNull(ВЫБОР
		|		КОГДА ВТ.ТипЭлемента = 1
		|			ТОГДА ВЫРАЗИТЬ(ВТ.ОбъектПланирования КАК Справочник.ПричиныОбращений).ТипАвторабот.РеквизитДопУпорядочивания
		|		ИНАЧЕ ВЫРАЗИТЬ(ВТ.ОбъектПланирования КАК Справочник.Автоработы).Тип.РеквизитДопУпорядочивания
		|	КОНЕЦ,0) КАК Порядок,
		|	ВТ.ИдентификаторПричиныОбращения КАК ИдентификаторПричиныОбращения,
		|	ВТ.ТипЭлемента КАК ТипЭлемента
		|ИЗ
		|	ВТ КАК ВТ
		|	УПОРЯДОЧИТЬ ПО Порядок";
		
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("ИдентификаторСтроки",Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15)));
	СписокТипов = Новый Массив;
    СписокТипов.Добавить(Тип("СправочникСсылка.ПричиныОбращений"));
    СписокТипов.Добавить(Тип("СправочникСсылка.Автоработы"));
	ТаблицаОбъектов.Колонки.Добавить("ОбъектПланирования", Новый ОписаниеТипов(СписокТипов));
	ТаблицаОбъектов.Колонки.Добавить("ТипЭлемента", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1)));
	ТаблицаОбъектов.Колонки.Добавить("ИдентификаторПричиныОбращения", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	
	Для каждого Элемент Из МассивЭлементов Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОбъектов.Добавить(),Элемент); 
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ТаблицаОбъектов", ТаблицаОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивЭлементов.Очистить(); 
	
	Пока Выборка.Следующий() Цикл
		СтурктураОбъекта = Новый Структура("ИдентификаторСтроки,ТипЭлемента,ИдентификаторПричиныОбращения");
		ЗаполнитьЗначенияСвойств(СтурктураОбъекта, Выборка); 
		МассивЭлементов.Добавить(СтурктураОбъекта);
	КонецЦикла;
	
	Возврат МассивЭлементов;
КонецФункции // ПолучитьПорядокЭлементов()

// Выполняет контроль пересечения интервалов планирования документов
//
// Параметры:
//  Интервалы - ТаблицаЗначений, ДанныеФормыКоллекция                    - Коллекция интервалов документа
//  Документ  - ДокументСсылка.ЗаявкаНаРемонт, ДокументСсылка.ЗаказНаряд - Проверяемый документ
// 
// Возвращаемое значение:
//  Структура - Структура разультата:
//  * Отказ - Булево -  Признак успешности действия
//  * ТекстОшибки - Строка - Текст ошибки
//  * Справшивать - Булево - Признак необходимости спрашивать пользователя.
//
Функция КонтрольПересеченияИнтервалов(Знач Интервалы, Документ) Экспорт
	
	Возврат ПланированиеРесурсов.КонтрольПересеченияИнтервалов(Интервалы, Документ);
	
КонецФункции // КонтрольПересеченияИнтервалов()

// Проверяет возможно ли планирование объекта на указанных ресурсах,
// тип объекта планирования должен содержаться в типе переданных ресурсов.
//
// Параметры:
//  Объект  - СправочникСсылка.ПричиныОбращения, СправочникСсылка.Автоработы - Проверяемый объект планирования.
//  ВыделенныеРесурсы - Массив - Массив со ссылками на проверяемые ресурсы планирования,
//                               ресурсы должны быть одного типа.
//
// Возвращаемое значение:
//   Булево - Истина если планирование доступно на всех ресурсах,
//            ложь если хотябы на одном планирование не возможно.
//
Функция ДоступноПланированиеОбъектаНаРесурсе(Объект, ВыделенныеРесурсы) Экспорт
	
	// получим тип объекта планирования
	Тип = ОбщегоНазначения.
		ЗначениеРеквизитаОбъекта(Объект, ?(ТипЗнч(Объект) = Тип("СправочникСсылка.Автоработы"), "Тип", "ТипАвторабот"));
	
	// получим типы ресурсов
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ресурс,
	|	Сотрудники.ТипРесурса КАК ТипРесурса
	|ПОМЕСТИТЬ Ресурсы
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В (&Ресурсы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Цеха.Ссылка,
	|	Цеха.ТипРесурса
	|ИЗ
	|	Справочник.Цеха КАК Цеха
	|ГДЕ
	|	Цеха.Ссылка В(&Ресурсы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ресурсы.Ресурс КАК Ресурс,
	|	Ресурсы.ТипРесурса КАК ТипРесурса,
	|	ТипыРесурсовДоступныеТипыАвторабот.ТипАвтоработы КАК ТипАвтоработы
	|ИЗ
	|	Ресурсы КАК Ресурсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыРесурсов.ДоступныеТипыАвторабот КАК ТипыРесурсовДоступныеТипыАвторабот
	|		ПО Ресурсы.ТипРесурса = ТипыРесурсовДоступныеТипыАвторабот.Ссылка
	|ГДЕ
	|	ТипыРесурсовДоступныеТипыАвторабот.ТипАвтоработы = &ТипАвтоработы");
	
	Запрос.УстановитьПараметр("Ресурсы", ВыделенныеРесурсы);
	Запрос.УстановитьПараметр("ТипАвтоработы", Тип);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() ИЛИ РезультатЗапроса.Выбрать().Количество() <> ВыделенныеРесурсы.Количество() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ДоступноПланированиеОбъектаНаРесурсе()


#КонецОбласти
